; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v8)
             (pred_4 ?v3 ?v1)
             (pred_11 ?v13 ?v1)
             (pred_2 ?v10 ?v13 )
	     (pred_9 ?v13)
             (pred_1 ?v4)
             (pred_5 ?v3)
             (pred_6 ?v1)
             (pred_12 ?v13)
             (pred_8 ?v3)
             (pred_3 ?v13)
             (pred_10 ))



(:action op_3
:parameters (?v11 ?v2 ?v6 ?v9)
:precondition (and (pred_1 ?v11) (pred_1 ?v2) (pred_5 ?v6) (pred_6 ?v9)
          (pred_7 ?v11 ?v2) (pred_4 ?v6 ?v9)
                   (pred_11 ?v2 ?v9) (pred_9 ?v11) 
                   (pred_12 ?v2) (pred_8 ?v6))
:effect (and  (pred_3 ?v2) (not (pred_12 ?v2))))


(:action op_5
:parameters (?v11 ?v7)
:precondition (and (pred_1 ?v11) (pred_1 ?v7)
               (pred_9 ?v11) (pred_7 ?v11 ?v7) (pred_3 ?v7))
:effect (and (pred_9 ?v7) (not (pred_9 ?v11))))

(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_1 ?v11) (pred_5 ?v6) 
                  (pred_9 ?v11) (pred_2 ?v6 ?v11) (pred_10 ))
:effect (and (pred_8 ?v6)
   (not (pred_2 ?v6 ?v11)) (not (pred_10 ))))


(:action op_4
:parameters (?v11 ?v12 ?v5)
:precondition (and (pred_1 ?v11) (pred_5 ?v12) (pred_5 ?v5)
                  (pred_9 ?v11) (pred_8 ?v5) (pred_2 ?v12 ?v11))
:effect (and (pred_8 ?v12) (pred_2 ?v5 ?v11)
        (not (pred_8 ?v5)) (not (pred_2 ?v12 ?v11))))

(:action op_2
:parameters (?v11 ?v6)
:precondition (and (pred_1 ?v11) (pred_5 ?v6) 
                  (pred_9 ?v11) (pred_8 ?v6))
:effect (and (pred_10 ) (pred_2 ?v6 ?v11) (not (pred_8 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_23 obj_02 obj_13 obj_30 obj_26 obj_07 obj_18 obj_09 obj_03 obj_22 obj_19 obj_11 obj_04 obj_10 obj_28 obj_29 obj_01 obj_31 obj_25 obj_14 obj_08 obj_06 obj_17 obj_15 obj_05
    obj_27 obj_16 obj_24
    obj_12 obj_32 obj_21 obj_20
    )

    (:init
       (pred_10)

       (pred_1 obj_23)
       (pred_1 obj_02)
       (pred_1 obj_13)
       (pred_1 obj_30)
       (pred_1 obj_26)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_09)
       (pred_1 obj_03)
       (pred_1 obj_22)
       (pred_1 obj_19)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_01)
       (pred_1 obj_31)
       (pred_1 obj_25)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_6 obj_27)
       (pred_6 obj_16)
       (pred_6 obj_24)
       (pred_5 obj_12)
       (pred_5 obj_32)
       (pred_5 obj_21)
       (pred_5 obj_20)

       (pred_7 obj_23 obj_07)
       (pred_7 obj_23 obj_02)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_23)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_30)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_26)
       (pred_7 obj_30 obj_13)
       (pred_7 obj_26 obj_22)
       (pred_7 obj_26 obj_30)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_18)
       (pred_7 obj_07 obj_23)
       (pred_7 obj_18 obj_11)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_18 obj_07)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_22)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_22 obj_28)
       (pred_7 obj_22 obj_26)
       (pred_7 obj_22 obj_03)
       (pred_7 obj_19 obj_29)
       (pred_7 obj_19 obj_11)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_11 obj_01)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_18)
       (pred_7 obj_11 obj_19)
       (pred_7 obj_04 obj_31)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_10 obj_25)
       (pred_7 obj_10 obj_28)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_28 obj_14)
       (pred_7 obj_28 obj_22)
       (pred_7 obj_28 obj_10)
       (pred_7 obj_29 obj_08)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_29 obj_19)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_31)
       (pred_7 obj_01 obj_11)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_31 obj_17)
       (pred_7 obj_31 obj_25)
       (pred_7 obj_31 obj_04)
       (pred_7 obj_31 obj_01)
       (pred_7 obj_25 obj_15)
       (pred_7 obj_25 obj_14)
       (pred_7 obj_25 obj_10)
       (pred_7 obj_25 obj_31)
       (pred_7 obj_14 obj_05)
       (pred_7 obj_14 obj_28)
       (pred_7 obj_14 obj_25)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_08 obj_29)
       (pred_7 obj_06 obj_17)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_31)
       (pred_7 obj_17 obj_06)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_25)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_05 obj_14)
       (pred_7 obj_05 obj_15)
       (pred_12 obj_02)
       (pred_12 obj_18)
       (pred_12 obj_07)
       (pred_12 obj_04)
       (pred_11  obj_02 obj_27)
       (pred_11  obj_18 obj_16)
       (pred_11  obj_07 obj_24)
       (pred_11  obj_04 obj_27)
       (pred_3 obj_23)
       (pred_3 obj_13)
       (pred_3 obj_30)
       (pred_3 obj_26)
       (pred_3 obj_09)
       (pred_3 obj_03)
       (pred_3 obj_22)
       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_10)
       (pred_3 obj_28)
       (pred_3 obj_29)
       (pred_3 obj_01)
       (pred_3 obj_31)
       (pred_3 obj_25)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_05)

       (pred_4  obj_12 obj_27)
       (pred_4  obj_32 obj_16)
       (pred_4  obj_21 obj_24)
       (pred_4  obj_20 obj_27)
       (pred_2 obj_12 obj_29)
       (pred_2 obj_32 obj_22)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_20 obj_08)
       (pred_9 obj_26)
    )

    (:goal (and
       (pred_2 obj_32 obj_19)
       (pred_2 obj_20 obj_17)
    ))
(:constraints
  (always (not (pred_9 obj_06)))
)
)

; plan
1. (op_5 obj_26 obj_22)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_22)
   goals met: 0 of 2
2. (op_1 obj_22 obj_32)
   deleted: (pred_2 obj_32 obj_22) (pred_10)
   added: (pred_8 obj_32)
   goals met: 0 of 2
3. (op_5 obj_22 obj_03)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_03)
   goals met: 0 of 2
4. (op_5 obj_03 obj_10)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_10)
   goals met: 0 of 2
5. (op_5 obj_10 obj_25)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_25)
   goals met: 0 of 2
6. (op_5 obj_25 obj_31)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_31)
   goals met: 0 of 2
7. (op_5 obj_31 obj_17)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_17)
   goals met: 0 of 2
8. (op_2 obj_17 obj_32)
   deleted: (pred_8 obj_32)
   added: (pred_10) (pred_2 obj_32 obj_17)
   goals met: 0 of 2
9. (op_5 obj_17 obj_31)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_31)
   goals met: 0 of 2
10. (op_5 obj_31 obj_01)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_01)
   goals met: 0 of 2
11. (op_5 obj_01 obj_29)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_29)
   goals met: 0 of 2
12. (op_1 obj_29 obj_12)
   deleted: (pred_2 obj_12 obj_29) (pred_10)
   added: (pred_8 obj_12)
   goals met: 0 of 2
13. (op_5 obj_29 obj_19)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_19)
   goals met: 0 of 2
14. (op_2 obj_19 obj_12)
   deleted: (pred_8 obj_12)
   added: (pred_10) (pred_2 obj_12 obj_19)
   goals met: 0 of 2
15. (op_5 obj_19 obj_29)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_29)
   goals met: 0 of 2
16. (op_5 obj_29 obj_08)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_08)
   goals met: 0 of 2
17. (op_1 obj_08 obj_20)
   deleted: (pred_2 obj_20 obj_08) (pred_10)
   added: (pred_8 obj_20)
   goals met: 0 of 2
18. (op_5 obj_08 obj_29)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_29)
   goals met: 0 of 2
19. (op_5 obj_29 obj_01)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_01)
   goals met: 0 of 2
20. (op_5 obj_01 obj_31)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_31)
   goals met: 0 of 2
21. (op_5 obj_31 obj_17)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_17)
   goals met: 0 of 2
22. (op_4 obj_17 obj_32 obj_20)
   deleted: (pred_8 obj_20) (pred_2 obj_32 obj_17)
   added: (pred_8 obj_32) (pred_2 obj_20 obj_17)
   goals met: 1 of 2
23. (op_5 obj_17 obj_31)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_31)
   goals met: 1 of 2
24. (op_5 obj_31 obj_01)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_01)
   goals met: 1 of 2
25. (op_5 obj_01 obj_11)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_11)
   goals met: 1 of 2
26. (op_5 obj_11 obj_19)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_19)
   goals met: 1 of 2
27. (op_4 obj_19 obj_12 obj_32)
   deleted: (pred_8 obj_32) (pred_2 obj_12 obj_19)
   added: (pred_8 obj_12) (pred_2 obj_32 obj_19)
   goals met: 2 of 2
